libxmlbus/data/wsaddr-testset/documents/echo/soap12/test1250request.xml

<?xml version="1.0"?>
<!-- $Id: test1250request.xml,v 1.5 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:F6003B5B-31EF-49F2-93DB-AA8040E76082</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://example.org/node/A</wsa:Address>
    </wsa:ReplyTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
